performance/src/scenarios/nft-tests.yml
config:
  target: "https://api-test.creditcoin.org"
  processor: "./nft-tests.ts"
  environments:
    dev:
      target: "https://api-dev.creditcoin.org"
      phases:
        - duration: 1
          arrivalCount: 1
          name: "Single test run"
      variables:
        network: "102031"
        publicAddress: "0xf68cD61F01dD40891c8CA89935ee11fbA4Be5d3C"
    test:
      target: "https://api-test.creditcoin.org"
      phases:
        - duration: 1
          arrivalCount: 1
          name: "Single test run"
      variables:
        network: "102031"
        publicAddress: "0xf68cD61F01dD40891c8CA89935ee11fbA4Be5d3C"
  plugins:
    ensure: {}
    metrics-by-endpoint: {}
  ensure:
    maxErrorRate: 1
    maxResponseTime: 20000
  debug: true
  output:
    csv:
      path: "data.csv"
      columns:
        - "timestamp"
        - "address"
        - "network"
        - "statusCode"
        - "responseTime"
        - "responseBody"
  # Load environment variables
  environment:
    PRIVATE_KEY: "${PRIVATE_KEY}"

scenarios:
  - name: "Get Transaction History"
    flow:
      - function: "setupTransactionHistoryRequest"
      - get:
          url: "/history/v1/evm/{{network}}/{{publicAddress}}"
          headers:
            "REQUEST-SIGNATURE": "eyJ0eXBlIjoiZXRoLXBlcnNvbmFsIiwibWVzc2FnZSI6Im1lc3NhZ2UiLCJhZGRyZXNzIjoiMHhmNjhjRDYxRjAxZEQ0MDg5MWM4Q0E4OTkzNWVlMTFmYkE0QmU1ZDNDIiwiZXhwaXJhdGlvbiI6IjIwMjUtMDMtMjkgMTk6MTg6NDMgVVRDIiwic2lnbmF0dXJlIjoiMHgxZTMxMjI5ZDI0ZGMwYTFlZGY1OTc5NGUwYTMxM2NlYTQ2MjA1ZWI3ZGYzNmM1YWM2ODIxZDk0OTA1YWFjYTY3NDZiZWM2OWYzNDc1OTE2NGE5YmJkY2Q3NTJlY2E4MzBlMjRhZDEyY2U4OGJkMTE5NDY2Y2QzM2QyMTZkNjBhZTFjIn0="
            "Content-Type": "application/json"
          expect:
            statusCode: 200
      - function: "logResponseDetails"
    afterScenario: "logError"